In [1]:
# we can also make our own functions just like python for more complex calculations like calculating z score

In [2]:
import pandas as pd

In [3]:
def my_function(n):
    return n**2

In [4]:
my_function(5)

25

In [5]:
df=pd.DataFrame({'a':[1,2,3],'b':[100,200,300]})

In [6]:
df

   a    b
0  1  100
1  2  200
2  3  300

In [7]:
df.apply(my_function)

   a      b
0  1  10000
1  4  40000
2  9  90000

In [8]:
#whenever we apply any function on a dataframe, it gets applied column by column basis by default
'''also it passes the entire column in one argument/variable so
def average(x,y,z)
     return x+y+z/3.0 
this wont work as nothing is passed in y and z'''

'also it passes the entire column in one argument/variable so\ndef average(x,y,z)\n     return x+y+z/3.0 \nthis wont work as nothing is passed in y and z'

In [15]:
def average(col):
      x=col[0]
      y=col[1]
      z=col[2]
      return (x+y+z)/3.0

In [16]:
df.apply(average)

a      2.0
b    200.0
dtype: float64

In [17]:
#for doing something row by row basis, just specify the axis in apply function
def average(col):
      x=col[0]
      y=col[1]
      
      return (x+y)/2    
    
df.apply(average, axis=1)

0     50
1    101
2    151
dtype: int64

In [18]:
import seaborn as sns

In [19]:
titanic=sns.load_dataset('titanic')

In [20]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [21]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
survived       891 non-null int64
pclass         891 non-null int64
sex            891 non-null object
age            714 non-null float64
sibsp          891 non-null int64
parch          891 non-null int64
fare           891 non-null float64
embarked       889 non-null object
class          891 non-null category
who            891 non-null object
adult_male     891 non-null bool
deck           203 non-null category
embark_town    889 non-null object
alive          891 non-null object
alone          891 non-null bool
dtypes: bool(2), category(2), float64(2), int64(4), object(5)
memory usage: 62.7+ KB

In [25]:
import numpy as np
np.sum([pd.isnull(titanic['age'])])

177

In [26]:
np.sum([pd.isnull(titanic['embarked'])])

2

In [29]:
np.sum(pd.isnull(titanic))

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [30]:
#you can also do this by writing methods for this and using apply function like
def count_missing(vec):
    null_vec=pd.isnull(vec)
    count=np.sum(null_vec)
    return count

In [37]:
titanic.apply(count_missing) #this gives you the same result

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [35]:
titanic.loc[pd.isnull(titanic['embarked']),:] #to see the data in rows where embarked value is missing

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
61,1,1,female,38.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True
829,1,1,female,62.0,0,0,80.0,NaN,First,woman,False,B,NaN,yes,True

In [40]:
#to see missing values row wise
titanic.apply(count_missing,axis=1).value_counts()
#549 rows has 1 missing value. 160 rows has 2 missing values

1    549
0    182
2    160
dtype: int64